app/views/schools/show.html.erb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."school_id" = ?  [["school_id", 1]]
---
<ul>
  <% @school.teachers.each do |t|%>

SELECT "students".* FROM "students" WHERE "students"."school_id" = ?  [["school_id", 1]]
---
<ul>
  <% @school.students.each do |s|%>