app/controllers/students_controller.rb

SELECT "schools".* FROM "schools"
---
  def new
    @student = Student.new()
    @schools = School.all

INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "Normal Name"], ["age", 29], ["created_at", "2019-07-18 19:27:08.044074"], ["updated_at", "2019-07-18 19:27:08.044074"], ["school_id", 1]]
---
  def create
    Student.create(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "schools".* FROM "schools"
---
  def edit
    @student = Student.find(params[:id])
    @schools = School.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Phillip Smalls"], ["updated_at", "2019-07-18 19:39:15.568653"], ["id", 1]]
---
  def update
    student = Student.find(params[:id])
    student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def delete
    student = Student.find(params[:id])
    school_redirect = student.school.id
    student.delete