app/controllers/teachers_controller.rb

SELECT "schools".* FROM "schools"
---
  def new
    @teacher = Teacher.new()
    @schools = School.all

INSERT INTO "teachers" ("name", "age", "school_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ian"], ["age", 32], ["school_id", 1], ["created_at", "2019-07-18 22:29:14.639759"], ["updated_at", "2019-07-18 22:29:14.639759"]]
---
  def create
    teacher = Teacher.create(teacher_params)

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "schools".* FROM "schools"
---
  def edit
    @teacher = Teacher.find(params[:id])
    @schools = School.all

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "teachers" SET "age" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["age", 28], ["updated_at", "2019-07-18 22:35:44.722068"], ["id", 1]]
---
  def update
    teacher = Teacher.find(params[:id])
    teacher.update(teacher_params)

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 6]]
---
  def delete
    teacher = Teacher.find(params[:id])
    teacher.delete